config/cf/Catalogs/ОформленияОповещенийEmailПравилСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ОформленияОповещенийEmailПравилСобытий</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БлокШапка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокПодвал</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/cf/Catalogs/ОформленияОповещенийEmailПравилСобытий/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Заполняет предопределенные элементы.
//
// Параметры:
//   МассивЗаполнения - Массив - массив, который передан для перезаполнения, 
//		содержит ссылки на справочник Процессы, если Неопределено, значит полное перезаполнение.
//
Процедура ЗаполнитьПриПервоначальномЗаполнении() Экспорт
	
	Спр = Справочники.ОформленияОповещенийEmailПравилСобытий;
	
	Объект = Спр.СтандартноеОформление.ПолучитьОбъект();
	Объект.Наименование = НСтр("ru = 'Стандартное оформление'");
	Объект.БлокШапка 	= ТекстМакета("ШапкаСтандартноеОформление");
	Объект.БлокПодвал 	= ТекстМакета("ПодвалСтандартноеОформление");
	Объект.Записать();
	
	Объект = Спр.СовременныйШаблон.ПолучитьОбъект();
	Объект.Наименование = НСтр("ru = 'Современный шаблон'");
	Объект.БлокШапка 	= ТекстМакета("ШапкаСовременныйШаблон");
	Объект.БлокПодвал 	= ТекстМакета("ПодвалСовременныйШаблон");
	Объект.Записать();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстМакета(ИмяМакета)
	
	Макет = Справочники.ОформленияОповещенийEmailПравилСобытий.ПолучитьМакет(ИмяМакета);
	Возврат Макет.ПолучитьТекст();
	
КонецФункции

Функция ИзображениеМакета(ИмяМакета)
	
	Макет = Справочники.ОформленияОповещенийEmailПравилСобытий.ПолучитьМакет(ИмяМакета);
	Возврат Новый ХранилищеЗначения(Макет);

КонецФункции

#КонецОбласти

#КонецЕсли
